alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/svd/ATSAML21G18B.svd
        <register>
          <name>STATUSD</name>
          <description>Peripheral write protection status - Bridge D</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EVSYS_</name>
              <description>EVSYS APB Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5_</name>
              <description>SERCOM5 APB Protect Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4_</name>
              <description>TC4 APB Protect Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC_</name>
              <description>ADC APB Protect Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_</name>
              <description>AC APB Protect Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTC_</name>
              <description>PTC APB Protect Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPAMP_</name>
              <description>OPAMP APB Protect Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCL_</name>
              <description>CCL APB Protect Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSE</name>
          <description>Peripheral write protection status - Bridge E</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PAC_</name>
              <description>PAC APB Protect Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAC_</name>
              <description>DMAC APB Protect Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PM</name>
      <version>1.0.2</version>
      <description>Power Manager</description>
      <groupName>PM</groupName>
      <prependToName>PM_</prependToName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SYSTEM</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>IORET</name>
              <description>I/O Retention</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SLEEPCFG</name>
          <description>Sleep Configuration</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <resetValue>0x02</resetValue>
          <fields>
            <field>
              <name>SLEEPMODE</name>
              <description>Sleep Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SLEEPMODESelect</name>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>CPU, AHBx, and APBx clocks are OFF</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STANDBY</name>
                  <description>All Clocks are OFF</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BACKUP</name>
                  <description>Only Backup domain is powered ON</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>All power domains are powered OFF</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLCFG</name>
          <description>Performance Level Configuration</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLSEL</name>
              <description>Performance Level Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PLSELSelect</name>
                <enumeratedValue>
                  <name>PL0</name>
                  <description>Performance Level 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PL1</name>
                  <description>Performance Level 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PL2</name>
                  <description>Performance Level 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLDIS</name>
              <description>Performance Level Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Ready interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PLRDY</name>
              <description>Performance Level Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STDBYCFG</name>
          <description>Standby Configuration</description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PDCFG</name>
              <description>Power Domain Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PDCFGSelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>All power domains switching is handled by hardware.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD0</name>
                  <description>PD0 is forced ACTIVE. PD1 and PD2 power domains switching is handled by hardware.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD01</name>
                  <description>PD0 and PD1 are forced ACTIVE. PD2 power domain switching is handled by hardware.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD012</name>
                  <description>All power domains are forced ACTIVE.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPGPD0</name>
              <description>Dynamic Power Gating for PD0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPGPD1</name>
              <description>Dynamic Power Gating for PD1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VREGSMOD</name>
              <description>Voltage Regulator Standby mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>VREGSMODSelect</name>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERFORMANCE</name>
                  <description>Performance oriented</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Low Power oriented</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LINKPD</name>
              <description>Linked Power Domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>LINKPDSelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Power domains are not linked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD01</name>
                  <description>PD0 and PD1 power domains are linked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD12</name>
                  <description>PD1 and PD2 power domains are linked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD012</name>
                  <description>All power domains are linked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BBIASHS</name>
              <description>Back Bias for HMCRAMCHS</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BBIASLP</name>
              <description>Back Bias for HMCRAMCLP</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>BBIASPP</name>
              <description>Back Bias for PicoPram</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PWSAKDLY</name>
          <description>Power Switch Acknowledge Delay</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DLYVAL</name>
              <description>Delay Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
            <field>
              <name>IGNACK</name>
              <description>Ignore Acknowledge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
